{"id":"45glzlzazs9w7drx","createdAt":1726240625039,"updatedAt":1726248741235,"type":"stories","title":"Test","order":0,"text":"","author":"ur momo","prefs":{},"status":2,"wordCount":2,"chapterCount":2,"outline":[{"title":"Stage 1: Setup","text":"The opening must draw the reader into the initial setting of the story and introduce the everyday life your hero has been living. Describe your hero and any significant aspects that makes her special."},{"title":"Turning Point 1: Opportunity","text":"Your hero must be presented with an opportunity or challenge, which will create a new, visible desire, and will start the character on her journey."},{"title":"Stage 2: The New Situation","text":"Your hero will react to the new situation that resulted from the opportunity. They get acclimated to the new reality (perhaps clumsily), tries to figure out what’s going on, or formulates a specific plan for accomplishing their overall goal."},{"title":"Turning Point 2: Change of Plans","text":"Something must happen to your hero one-fourth of the way through your story that will transform the original desire into a specific, visible goal with a clearly defined end point. This is the scene where your story concept is defined, and your hero’s outer motivation is revealed."},{"title":"Stage 3: Progress","text":"For the next 25% of your story, your hero’s plan seems to be working as he takes action to achieve his goal. He gathers allies, tools, intel, etc. while dealing with obstacles."},{"title":"Turning Point 3: Point of No Return","text":"At the exact midpoint, your hero brushes against death (literal or metaphorical) as the full scope is revealed which surpasses the initial difficulty level. Your hero toughens up or sheds fears or flaws holding her back."},{"title":"Stage 4: Complications & Higher Stakes","text":"For the next 25% of your story, achieving the visible goal becomes far more difficult, and your hero has much more to lose if he fails."},{"title":"Turning Point 4: Major Setback","text":"Something must happen to your hero that makes it seem to the audience that all is lost and the initial plan will not work."},{"title":"Stage 5: Final Push","text":"Beaten and battered, your hero must now risk everything she has and give it her all to achieve her ultimate goal."},{"title":"Turning Point 5: Climax","text":"The hero must face the biggest obstacle of the entire story; she must determine her own fate; and the outer motivation must be resolved once and for all."},{"title":"Stage 6: Aftermath","text":"Reveal the new life your hero is living and show how he has evolved his behavior or actions."}],"curOutline":"Hauge's Six Stages","projectId":"np2zzaxdhb0zg6zx","coverImageId":"","frontMatterIds":[],"backMatterIds":[],"sceneIds":["kpoqqdhl2jitn4q2","nscal56gr7y7t6l6"],"chapterIds":["t0ozho6k3tgi3pzi","n95dwdrlsx74nd8y"],"tagIds":["6ddbvxqp7vpraany"],"plotlineIds":[]}